## [ DataFrame 인덱스 다루기 ]

- (1) 새로운 인덱스 설정 컬럼 ==> 인덱스 설정

(1) 모듈 로딩

In [42]:
import pandas as pd

(2) 데이터 준비

In [43]:
exam = { '이름': ['마징가', '베트맨', '홍길동', '임꺽정'],
         '국어': [98, 79, 99, 100],
         '미술': [70, 99, 87, 80],
         '수학': [80, 87, 99, 72],
         '체육': [72, 83, 90, 88]}

(3) 데이터 저장

In [44]:
examDF = pd.DataFrame(exam)

(4) 데이터 확인

In [45]:
examDF

    이름   국어  미술  수학  체육
0  마징가   98  70  80  72
1  베트맨   79  99  87  83
2  홍길동   99  87  99  90
3  임꺽정  100  80  72  88

(5) 새로운 인덱스 설정 - 방법 1 : 인덱스 일부 변경 DF.rename()

In [46]:
# 행 인덱스 일부 변경 => {기존인덱스:새로운인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False!!
examDF.rename(index={0:'zero'}, inplace=True)
examDF

       이름   국어  미술  수학  체육
zero  마징가   98  70  80  72
1     베트맨   79  99  87  83
2     홍길동   99  87  99  90
3     임꺽정  100  80  72  88

In [47]:
# 열 이름 인덱스 일부 변경 => column = {기존인덱스:새로운인덱스}
examDF.rename(columns = {'체육':'음악'}, inplace=True)

In [48]:
examDF

       이름   국어  미술  수학  음악
zero  마징가   98  70  80  72
1     베트맨   79  99  87  83
2     홍길동   99  87  99  90
3     임꺽정  100  80  72  88

- (5) 새로운 인덱스 설정 - 방법 2 : 특정 컬럼 => 인덱스 : DF.set_index()

In [49]:
# 현재 기본 0 ~ ==> 이름 컬럼 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [50]:
# 1개 컬럼을 인덱스로 설정 단, inplace 파라미터가 False로 원본 적용 안됨!
examDF2 = examDF.set_index('이름')
print(examDF2)

      국어  미술  수학  음악
이름
마징가   98  70  80  72
베트맨   79  99  87  83
홍길동   99  87  99  90
임꺽정  100  80  72  88

In [51]:
examDF2.index

Index(['마징가', '베트맨', '홍길동', '임꺽정'], dtype='object', name='이름')

In [52]:
examDF

       이름   국어  미술  수학  음악
zero  마징가   98  70  80  72
1     베트맨   79  99  87  83
2     홍길동   99  87  99  90
3     임꺽정  100  80  72  88

In [53]:
# 2개의 컬름을 행 인덱스 설정 단, inplace 파라미터가 False로 원본 적용 안됨!
examDF.set_index(['이름', '국어'])
examDF3 = examDF.set_index(['이름', '국어', '수학'])
print(examDF3)

            미술  음악
이름  국어  수학
마징가 98  80  70  72
베트맨 79  87  99  83
홍길동 99  99  87  90
임꺽정 100 72  80  88

In [54]:
examDF3.loc[('마징가', 98, 80)]

미술    70
음악    72
Name: (마징가, 98, 80), dtype: int64

In [55]:
examDF3.loc['마징가']

       미술  음악
국어 수학
98 80  70  72

In [56]:
# KeyError => '마징가,' 98, 98 형식에서 98로 시작하는 key 없음
# examDF3.loc[(98, n98)]

- (5) 새로운 인덱스 설정 - 방법 3 :

In [59]:
examDF.set_index('이름', inplace=True)

In [60]:
# 현재 행 인덱스 ==> 컬럼으로 추가
examDF.reset_index()

    이름   국어  미술  수학  음악
0  마징가   98  70  80  72
1  베트맨   79  99  87  83
2  홍길동   99  87  99  90
3  임꺽정  100  80  72  88

In [61]:
examDF.reset_index().reset_index()

   index   이름   국어  미술  수학  음악
0      0  마징가   98  70  80  72
1      1  베트맨   79  99  87  83
2      2  홍길동   99  87  99  90
3      3  임꺽정  100  80  72  88

In [62]:
# 현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정
df2 = examDF.reset_index(drop=True)
df2

    국어  미술  수학  음악
0   98  70  80  72
1   79  99  87  83
2   99  87  99  90
3  100  80  72  88